InformationRegisters/стомСвязьСостоянийИДиагнозов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>стомСвязьСостоянийИДиагнозов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>СостояниеЗуба</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомСостоянияЗубов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Диагноз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Диагнозы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/стомВидыОбластей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>стомВидыОбластей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбластьЗуба</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Конструкция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлементКонструкции</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/стомВидыЗубныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>стомВидыЗубныхКарт</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ШиринаКанвы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаКанвы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TranslateX</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TranslateY</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Rotation</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ScaleX</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ScaleY</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокЗубов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Зуб</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомВидыЗубов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TranslateX</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TranslateY</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Rotation</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ScaleX</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ScaleY</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ZIndex</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнойВариант</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомВариантыЗубов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтроковоеПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обозначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗубВКарте</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомЗубыКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокВариантов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантКарты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомВариантыЗубныхКарт</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтроковоеПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокВариантовЗубов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантЗуба</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомВариантыЗубов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокОбщихСегментов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантЗуба</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомВариантыЗубов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СегментВКарте</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомСегментыЗубов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкаВариантовОбластей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантКарты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомВариантыЗубныхКарт</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗубВКарте</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомЗубыКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантЗуба</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомВариантыЗубов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Область</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомОбластиСегментов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/стомОбластиСегментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>стомОбластиСегментов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Декоративная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обозначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбласти</Name>
					<Type>
						<v8:Type>cfg:EnumRef.стомВидыОбластей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкцияРодитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомОбластиСегментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоКонструкции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомОбластиСегментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерединаКонструкции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомОбластиСегментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецКонструкции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомОбластиСегментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокСостояний</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.стомСостоянияЗубов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокПараметров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.стомПараметрыЗубнойФормулы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/стомСостоянияЗубов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>стомСостоянияЗубов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КраткоеОбозначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесьЗуб</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветHex</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтроковоеПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/стомЗубыКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>стомЗубыКарты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.стомВидыЗубныхКарт</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Зуб</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомВидыЗубов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TranslateX</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TranslateY</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Rotation</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ScaleX</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ScaleY</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ZIndex</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/стомЗубнаяКартаИнициализация/Ext/Module.bsl
#Область ИнициализацияПриЗапускеПрограммы

Процедура УстановкаПараметровСеанса() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	КешЗК = Новый Структура;
	КешЗК.Вставить("Состояния", ИнициализироватьКешСостоянийОбластей());
	КешЗК.Вставить("Варианты", ИнициализироватьКешВариантовЗубов());
	КешЗК.Вставить("Диагнозы", ИнициализироватьКешДиагнозов());
	КешЗК.Вставить("ПриложениеHTML", ПолучитьHTMLПриложенияJS());
	
	ПараметрыСеанса.стомКешированныеДанныеЗК = Новый ФиксированнаяСтруктура(КешЗК);
	
	ШаблоныЗубныхКарт = Новый Соответствие;
	
	Если УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("КэшироватьДанныеЗубныхКартВПриёмах") Тогда
		Выб = Справочники.стомВидыЗубныхКарт.Выбрать();
		Пока Выб.Следующий() Цикл
			Если Не Выб.ПометкаУдаления Тогда
				ШаблоныЗубныхКарт.Вставить(Выб.Ссылка, ПоместитьВоВременноеХранилище(СформироватьШаблонЗубнойКарты(Выб.Ссылка, Ложь), Новый УникальныйИдентификатор));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	КешЗК.Вставить("ШаблоныЗубныхКарт", Новый ФиксированноеСоответствие(ШаблоныЗубныхКарт));
	
	ПараметрыСеанса.стомКешированныеДанныеЗК = Новый ФиксированнаяСтруктура(КешЗК);
	
КонецПроцедуры

Функция ИнициализироватьКешСостоянийОбластей() 
	
	СтруктураКеша = Новый Структура("Состояния, СостоянияПоИд, МаскиОбластей",
		Новый Массив, Новый Соответствие, Новый Соответствие);
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	стомОбластиСегментовСписокСостояний.Ссылка КАК Область,
	|	стомОбластиСегментовСписокСостояний.Состояние КАК Состояние
	|ИЗ
	|	Справочник.стомОбластиСегментов.СписокСостояний КАК стомОбластиСегментовСписокСостояний
	|ГДЕ
	|	стомОбластиСегментовСписокСостояний.Состояние <> ЗНАЧЕНИЕ(Справочник.стомСостоянияЗубов.ПустаяСсылка)
	|	И НЕ стомОбластиСегментовСписокСостояний.Состояние.ПометкаУдаления
	|	И НЕ стомОбластиСегментовСписокСостояний.Ссылка.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	стомОбластиСегментовСписокСостояний.Состояние.Предопределенный УБЫВ
	|ИТОГИ ПО
	|	Состояние";
	Результат = Запрос.Выполнить();
	
	ВыборкаСостояния = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КоличествоСостояний = ВыборкаСостояния.Количество();
	
	Маски = Новый Соответствие;
	
	СчСост = 0;
	Пока ВыборкаСостояния.Следующий() Цикл
		
		ИдСостояния = ВыборкаСостояния.Состояние.УникальныйИдентификатор();
		СтруктураСостояние = СоздатьСостояниеМаски(ВыборкаСостояния.Состояние, СчСост);
		СтруктураКеша.Состояния.Добавить(СтруктураСостояние);
		СтруктураКеша.СостоянияПоИд.Вставить(ИдСостояния, СтруктураСостояние);
		
		ВыборкаОбласти = ВыборкаСостояния.Выбрать();
		
		Пока ВыборкаОбласти.Следующий() Цикл
			
			МаскаОбласти = Маски.Получить(ВыборкаОбласти.Область);
			Если МаскаОбласти = Неопределено Тогда
				МаскаОбласти = ПобитовыеОперацииКлиентСервер.СоздатьИнициализироватьМассив(КоличествоСостояний, Ложь);
				Маски.Вставить(ВыборкаОбласти.Область, МаскаОбласти);
			КонецЕсли;
			
			МаскаОбласти[СчСост] = Истина;
			
		КонецЦикла;
		
		СчСост = СчСост + 1;
		
	КонецЦикла;
	
	Для Каждого кзМаска Из Маски Цикл
		СтруктураКеша.МаскиОбластей.Вставить(кзМаска.Ключ, Новый ФиксированныйМассив(кзМаска.Значение));
	КонецЦикла;
	
	СтруктураКеша.Вставить("Состояния", Новый ФиксированныйМассив(СтруктураКеша.Состояния));
	СтруктураКеша.Вставить("СостоянияПоИд", Новый ФиксированноеСоответствие(СтруктураКеша.СостоянияПоИд));
	СтруктураКеша.Вставить("МаскиОбластей", Новый ФиксированноеСоответствие(СтруктураКеша.МаскиОбластей));
	
	Возврат Новый ФиксированнаяСтруктура(СтруктураКеша);
	
КонецФункции

Функция ИнициализироватьКешВариантовЗубов()
	
	СтруктураКеша = Новый Структура("Варианты, ВариантыПоИд, МаскиВариантов",
		Новый Массив, Новый Соответствие, Новый Соответствие);
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	стомЗубыКарты.Ссылка КАК ЗубВКарте,
	|	стомВидыЗубовСписокВариантов.ВариантЗуба КАК ВариантЗуба
	|ИЗ
	|	Справочник.стомЗубыКарты КАК стомЗубыКарты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.стомВидыЗубов.СписокВариантов КАК стомВидыЗубовСписокВариантов
	|		ПО стомЗубыКарты.Зуб = стомВидыЗубовСписокВариантов.Ссылка
	|ГДЕ
	|	стомВидыЗубовСписокВариантов.ВариантЗуба <> ЗНАЧЕНИЕ(Справочник.стомВариантыЗубов.ПустаяСсылка)
	|	И НЕ стомЗубыКарты.ПометкаУдаления
	|	И НЕ стомВидыЗубовСписокВариантов.ВариантЗуба.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	стомВидыЗубовСписокВариантов.ВариантЗуба.Основной УБЫВ,
	|	стомВидыЗубовСписокВариантов.ВариантЗуба.Конструкция УБЫВ
	|ИТОГИ ПО
	|	ВариантЗуба";
	Результат = Запрос.Выполнить();
	
	ВыборкаВарианты = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КоличествоВариантов = ВыборкаВарианты.Количество();
	
	Маски = Новый Соответствие;
	
	СчВар = 0;
	Пока ВыборкаВарианты.Следующий() Цикл
		
		ИдВарианта = ВыборкаВарианты.ВариантЗуба.УникальныйИдентификатор();
		СтруктураВариант = СоздатьВариантМаски(ВыборкаВарианты.ВариантЗуба, СчВар);
		СтруктураКеша.Варианты.Добавить(СтруктураВариант);
		СтруктураКеша.ВариантыПоИд.Вставить(ИдВарианта, СтруктураВариант);
		
		ВыборкаЗубы = ВыборкаВарианты.Выбрать();
		
		Пока ВыборкаЗубы.Следующий() Цикл
			
			МаскаЗуба = Маски.Получить(ВыборкаЗубы.ЗубВКарте);
			Если МаскаЗуба = Неопределено Тогда
				МаскаЗуба = ПобитовыеОперацииКлиентСервер.СоздатьИнициализироватьМассив(КоличествоВариантов, Ложь);
				Маски.Вставить(ВыборкаЗубы.ЗубВКарте, МаскаЗуба);
			КонецЕсли;
			
			МаскаЗуба[СчВар] = Истина;
			
		КонецЦикла;
		
		СчВар = СчВар + 1;
		
	КонецЦикла;
	
	Для Каждого кзМаска Из Маски Цикл
		СтруктураКеша.МаскиВариантов.Вставить(кзМаска.Ключ, Новый ФиксированныйМассив(кзМаска.Значение));
	КонецЦикла;
	
	СтруктураКеша.Вставить("Варианты", Новый ФиксированныйМассив(СтруктураКеша.Варианты));
	СтруктураКеша.Вставить("ВариантыПоИд", Новый ФиксированноеСоответствие(СтруктураКеша.ВариантыПоИд));
	СтруктураКеша.Вставить("МаскиВариантов", Новый ФиксированноеСоответствие(СтруктураКеша.МаскиВариантов));
	
	Возврат Новый ФиксированнаяСтруктура(СтруктураКеша);
	
КонецФункции

Функция ИнициализироватьКешДиагнозов()
	
	СтруктураКеша = Новый Структура("Диагнозы, ДиагнозыПоИд, МаскиСостояний",
		Новый Массив, Новый Соответствие, Новый Соответствие);
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("стомГруппаДиагнозов", УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("СтоматологическиеДиагнозы"));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Диагнозы.Ссылка КАК Диагноз
	//|	Диагнозы.КодДиагноза КАК КодДиагноза
	|ПОМЕСТИТЬ стомДиагнозы
	|ИЗ
	|	Справочник.Диагнозы КАК Диагнозы
	|ГДЕ
	|	НЕ Диагнозы.ЭтоГруппа
	|	И НЕ Диагнозы.ПометкаУдаления
	|	И &стомГруппаДиагнозов <> ЗНАЧЕНИЕ(Справочник.Диагнозы.ПустаяСсылка)
	|	И Диагнозы.Ссылка В ИЕРАРХИИ(&стомГруппаДиагнозов)
	|	И НЕ Диагнозы.Архив
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	стомДиагнозы.Диагноз КАК Диагноз,
	//|	стомДиагнозы.КодДиагноза КАК КодДиагноза,
	|	стомСвязьСостоянийИДиагнозов.СостояниеЗуба КАК СостояниеЗуба,
	|	НЕ стомСвязьСостоянийИДиагнозов.СостояниеЗуба ЕСТЬ NULL КАК ЕстьСостояния
	|ИЗ
	|	стомДиагнозы КАК стомДиагнозы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.стомСвязьСостоянийИДиагнозов КАК стомСвязьСостоянийИДиагнозов
	|		ПО стомДиагнозы.Диагноз = стомСвязьСостоянийИДиагнозов.Диагноз
	|ИТОГИ
	|	МАКСИМУМ(ЕстьСостояния)
	|ПО
	|	Диагноз";
	Результат = Запрос.Выполнить();
	
	ВыборкаДиагнозы = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КоличествоДиагнозов = ВыборкаДиагнозы.Количество();
	
	Маски = Новый Соответствие;
	
	СчДиагнозов = 0;
	Пока ВыборкаДиагнозы.Следующий() Цикл
		
		ИдДиагноза = ВыборкаДиагнозы.Диагноз.УникальныйИдентификатор();
		СтруктураДиагноз = СоздатьДиагнозМаски(ВыборкаДиагнозы.Диагноз, СчДиагнозов);
		СтруктураКеша.Диагнозы.Добавить(СтруктураДиагноз);
		СтруктураКеша.ДиагнозыПоИд.Вставить(ИдДиагноза, СтруктураДиагноз);
		
		ВыборкаСостояния = ВыборкаДиагнозы.Выбрать();
		
		Если ВыборкаДиагнозы.ЕстьСостояния Тогда 
			
			Пока ВыборкаСостояния.Следующий() Цикл
				
				МаскаСостояния = Маски.Получить(ВыборкаСостояния.СостояниеЗуба);
				Если МаскаСостояния = Неопределено Тогда
					МаскаСостояния = ПобитовыеОперацииКлиентСервер.СоздатьИнициализироватьМассив(КоличествоДиагнозов, Ложь);
					Маски.Вставить(ВыборкаСостояния.СостояниеЗуба, МаскаСостояния);
				КонецЕсли;
				
				МаскаСостояния[СчДиагнозов] = Истина;
				
			КонецЦикла;
			
		КонецЕсли;
		
		СчДиагнозов = СчДиагнозов + 1;
		
	КонецЦикла;
	
	Для Каждого кзМаска Из Маски Цикл
		СтруктураКеша.МаскиСостояний.Вставить(кзМаска.Ключ, Новый ФиксированныйМассив(кзМаска.Значение));
	КонецЦикла;
	
	СтруктураКеша.Вставить("Диагнозы", Новый ФиксированныйМассив(СтруктураКеша.Диагнозы));
	СтруктураКеша.Вставить("ДиагнозыПоИд", Новый ФиксированноеСоответствие(СтруктураКеша.ДиагнозыПоИд));
	СтруктураКеша.Вставить("МаскиСостояний", Новый ФиксированноеСоответствие(СтруктураКеша.МаскиСостояний));
	
	Возврат Новый ФиксированнаяСтруктура(СтруктураКеша);
	
КонецФункции

Функция ПолучитьHTMLПриложенияJS() Экспорт
	
	СтраницаHTML = Справочники.стомВидыЗубныхКарт.ПолучитьМакет("ЗубнаяКартаJS");
	KonvaJS = Справочники.стомВидыЗубныхКарт.ПолучитьМакет("KonvaJS");
	
	Возврат СтрЗаменить(СтраницаHTML.ПолучитьТекст(), "<<ИмяФайлаKonvaJS>>", ОбщегоНазначенияКлиентСерверПереопределяемый.ПрочитатьТекстДвоичныхДанных(KonvaJS));
	
КонецФункции

#КонецОбласти

#Область ИнициализацияПриЗагрузкеЗК

Функция ИнициализироватьЗубнуюКарту(ЗубнаяКарта, Клиент, УникальныйИдентификатор,
	Дата = Неопределено, ВариантКарты = Неопределено, Документ = Неопределено, ДанныеЗКИстории = Неопределено) Экспорт
	
	Если ДанныеЗКИстории <> Неопределено Тогда
		Если ДанныеЗКИстории.АдресЗК <> Неопределено Тогда
			СтруктураЗК = стомЗубнаяКартаМетоды.ПолучитьСтруктуруЗК(ДанныеЗКИстории.АдресЗК);
			ОчиститьСостоянияВариантыЗубов(СтруктураЗК);
		Иначе
			ШаблонЗК = СформироватьШаблонЗубнойКарты(ЗубнаяКарта, Ложь);
			ДанныеЗКИстории.АдресЗК = ПоместитьВоВременноеХранилище(ШаблонЗК, УникальныйИдентификатор);
		КонецЕсли;
		ЗаполнитьШаблонЗубнойКарты(ДанныеЗКИстории.АдресЗК, Клиент, Дата, ВариантКарты, Документ, ДанныеЗКИстории.АдресСостояний, УникальныйИдентификатор);
		Возврат ДанныеЗКИстории.АдресЗК;
	КонецЕсли;
	
	ШаблонЗК = СформироватьШаблонЗубнойКарты(ЗубнаяКарта);
	АдресЗК = ПоместитьВоВременноеХранилище(ШаблонЗК, УникальныйИдентификатор);
	ЗаполнитьШаблонЗубнойКарты(АдресЗК, Клиент, Дата, ВариантКарты, Документ);
	
	Возврат АдресЗК;
	
КонецФункции

Функция СформироватьШаблонЗубнойКарты(ЗубнаяКарта, ИспользоватьКешШаблонов = Истина)
	
	Если ИспользоватьКешШаблонов Тогда
		ШаблонИзКеша = ПараметрыСеанса.стомКешированныеДанныеЗК.ШаблоныЗубныхКарт.Получить(ЗубнаяКарта);
		Если ШаблонИзКеша <> Неопределено Тогда
			СтруктураЗК = ПолучитьИзВременногоХранилища(ШаблонИзКеша);
			ОчиститьСостоянияВариантыЗубов(СтруктураЗК);
			Возврат СтруктураЗК;
		КонецЕсли;
	КонецЕсли;
	
	СтруктураЗК = СоздатьЗубнуюКарту(ЗубнаяКарта, , , , , , УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ИспользоватьCtrlДляЕдиничногоВыбораЗуба"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	стомЗубыКарты.Владелец КАК ЗубнаяКарта,
	|	стомЗубыКарты.Ссылка КАК ЗубВКарте,
	|	стомЗубыКарты.Зуб КАК Зуб
	|ПОМЕСТИТЬ ЗубыКарты
	|ИЗ
	|	Справочник.стомЗубыКарты КАК стомЗубыКарты
	|ГДЕ
	|	стомЗубыКарты.Владелец = &ЗубнаяКарта
	|	И НЕ стомЗубыКарты.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗубыКарты.ЗубнаяКарта КАК ЗубнаяКарта,
	|	ЗубыКарты.ЗубВКарте КАК ЗубВКарте,
	|	ЗубыКарты.Зуб КАК Зуб,
	|	стомВидыЗубовСписокВариантов.ВариантЗуба КАК ВариантЗуба,
	|	стомВариантыЗубовСписокОбластей.Область КАК Область,
	|	ВЫБОР
	|		КОГДА стомВидыЗубовСписокВариантов.Обозначение = """"
	|			ТОГДА ЗубыКарты.ЗубВКарте.Наименование
	|		ИНАЧЕ стомВидыЗубовСписокВариантов.Обозначение
	|	КОНЕЦ КАК Нумерация
	|ПОМЕСТИТЬ ЗубыВариантыОбласти
	|ИЗ
	|	ЗубыКарты КАК ЗубыКарты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.стомВидыЗубов.СписокВариантов КАК стомВидыЗубовСписокВариантов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.стомВариантыЗубов.СписокОбластей КАК стомВариантыЗубовСписокОбластей
	|			ПО стомВидыЗубовСписокВариантов.ВариантЗуба = стомВариантыЗубовСписокОбластей.Ссылка
	|		ПО ЗубыКарты.Зуб = стомВидыЗубовСписокВариантов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗубыВариантыОбласти.ЗубнаяКарта КАК ЗубнаяКарта,
	|	ЗубыВариантыОбласти.ЗубВКарте КАК ЗубВКарте,
	|	ЗубыВариантыОбласти.Зуб КАК Зуб,
	|	ЗубыВариантыОбласти.ВариантЗуба КАК ВариантЗуба,
	|	ЗубыВариантыОбласти.Область КАК Область,
	|	ЗубыВариантыОбласти.Область.НачалоКонструкции КАК НачалоКонструкции,
	|	ЗубыВариантыОбласти.Область.СерединаКонструкции КАК СерединаКонструкции,
	|	ЗубыВариантыОбласти.Область.КонецКонструкции КАК КонецКонструкции
	|ПОМЕСТИТЬ ВариантыОбластиКонструкции
	|ИЗ
	|	ЗубыВариантыОбласти КАК ЗубыВариантыОбласти
	|ГДЕ
	|	ЗубыВариантыОбласти.ВариантЗуба.Конструкция
	|	И ЗубыВариантыОбласти.Область.ВидОбласти = ЗНАЧЕНИЕ(Перечисление.стомВидыОбластей.Конструкция)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗубыВариантыОбласти.ЗубнаяКарта КАК ЗубнаяКарта,
	|	ЗубыВариантыОбласти.ЗубВКарте КАК ЗубВКарте,
	|	ЗубыВариантыОбласти.Зуб КАК Зуб,
	|	ЗубыВариантыОбласти.ВариантЗуба КАК ВариантЗуба,
	|	ЗубыВариантыОбласти.Область КАК Область,
	|	стомСегментыЗубов.Ссылка КАК СегментВЗубе,
	|	стомСегментыЗубов.Сегмент КАК Сегмент,
	|	ЗубыВариантыОбласти.Нумерация КАК Нумерация
	|ИЗ
	|	ЗубыВариантыОбласти КАК ЗубыВариантыОбласти
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.стомСегментыЗубов КАК стомСегментыЗубов
	|		ПО (ЗубыВариантыОбласти.ЗубнаяКарта = стомСегментыЗубов.Владелец
	|				ИЛИ ЗубыВариантыОбласти.Зуб = стомСегментыЗубов.Владелец)
	|			И ЗубыВариантыОбласти.Область = стомСегментыЗубов.Сегмент.Область
	|ГДЕ
	|	НЕ ЗубыВариантыОбласти.ВариантЗуба.Конструкция
	|	И НЕ стомСегментыЗубов.ПометкаУдаления
	|ИТОГИ
	|	МАКСИМУМ(Нумерация)
	|ПО
	|	ЗубВКарте,
	|	ВариантЗуба,
	|	Область
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВариантыОбластиКонструкции.ЗубнаяКарта КАК ЗубнаяКарта,
	|	ВариантыОбластиКонструкции.ЗубВКарте КАК ЗубВКарте,
	|	ВариантыОбластиКонструкции.Зуб КАК Зуб,
	|	ВариантыОбластиКонструкции.ВариантЗуба КАК ВариантЗуба,
	|	ВариантыОбластиКонструкции.Область КАК Область,
	|	ВариантыОбластиКонструкции.НачалоКонструкции КАК ЧастьКонструкции,
	|	""Начало"" КАК РасположениеЧасти,
	|	стомСегментыЗубов.Ссылка КАК СегментВЗубе,
	|	стомСегментыЗубов.Сегмент КАК Сегмент
	|ИЗ
	|	ВариантыОбластиКонструкции КАК ВариантыОбластиКонструкции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.стомСегментыЗубов КАК стомСегментыЗубов
	|		ПО ВариантыОбластиКонструкции.НачалоКонструкции = стомСегментыЗубов.Сегмент.Область
	|			И (ВариантыОбластиКонструкции.ЗубнаяКарта = стомСегментыЗубов.Владелец
	|				ИЛИ ВариантыОбластиКонструкции.Зуб = стомСегментыЗубов.Владелец)
	|ГДЕ
	|	НЕ стомСегментыЗубов.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВариантыОбластиКонструкции.ЗубнаяКарта,
	|	ВариантыОбластиКонструкции.ЗубВКарте,
	|	ВариантыОбластиКонструкции.Зуб,
	|	ВариантыОбластиКонструкции.ВариантЗуба,
	|	ВариантыОбластиКонструкции.Область,
	|	ВариантыОбластиКонструкции.СерединаКонструкции,
	|	""Середина"",
	|	стомСегментыЗубов.Ссылка,
	|	стомСегментыЗубов.Сегмент
	|ИЗ
	|	ВариантыОбластиКонструкции КАК ВариантыОбластиКонструкции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.стомСегментыЗубов КАК стомСегментыЗубов
	|		ПО ВариантыОбластиКонструкции.СерединаКонструкции = стомСегментыЗубов.Сегмент.Область
	|			И (ВариантыОбластиКонструкции.ЗубнаяКарта = стомСегментыЗубов.Владелец
	|				ИЛИ ВариантыОбластиКонструкции.Зуб = стомСегментыЗубов.Владелец)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВариантыОбластиКонструкции.ЗубнаяКарта,
	|	ВариантыОбластиКонструкции.ЗубВКарте,
	|	ВариантыОбластиКонструкции.Зуб,
	|	ВариантыОбластиКонструкции.ВариантЗуба,
	|	ВариантыОбластиКонструкции.Область,
	|	ВариантыОбластиКонструкции.КонецКонструкции,
	|	""Конец"",
	|	стомСегментыЗубов.Ссылка,
	|	стомСегментыЗубов.Сегмент
	|ИЗ
	|	ВариантыОбластиКонструкции КАК ВариантыОбластиКонструкции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.стомСегментыЗубов КАК стомСегментыЗубов
	|		ПО ВариантыОбластиКонструкции.КонецКонструкции = стомСегментыЗубов.Сегмент.Область
	|			И (ВариантыОбластиКонструкции.ЗубнаяКарта = стомСегментыЗубов.Владелец
	|				ИЛИ ВариантыОбластиКонструкции.Зуб = стомСегментыЗубов.Владелец)
	|ИТОГИ ПО
	|	ЗубВКарте,
	|	ВариантЗуба,
	|	Область,
	|	РасположениеЧасти,
	|	ЧастьКонструкции";
	Запрос.УстановитьПараметр("ЗубнаяКарта", ЗубнаяКарта);
	Результат = Запрос.ВыполнитьПакет();
	
	соотвСозданныеСегменты = Новый Соответствие;
	
	// Обычные варианты зубов
	ВыборкаЗубы = Результат[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЗубы.Следующий() Цикл
		
		СтруктураЗуб = СоздатьЗуб(СтруктураЗК, ВыборкаЗубы.ЗубВКарте);
		
		ВыборкаВарианты = ВыборкаЗубы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаВарианты.Следующий() Цикл 
			
			СтруктураВариант = СоздатьВариант(СтруктураЗуб, ВыборкаВарианты.ВариантЗуба, ВыборкаВарианты.Нумерация);
			
			ВыборкаОбласти = ВыборкаВарианты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаОбласти.Следующий() Цикл
				
				СтруктураОбласть = СоздатьОбласть(СтруктураВариант, ВыборкаОбласти.Область);
				
				ВыборкаСегменты = ВыборкаОбласти.Выбрать();
				Пока ВыборкаСегменты.Следующий() Цикл 
					
					СтруктураСегмент = СоздатьСегмент(СтруктураОбласть, ВыборкаСегменты.СегментВЗубе, соотвСозданныеСегменты);
					
				КонецЦикла; // Сегменты
				
			КонецЦикла; // Области
			
		КонецЦикла; // Варианты
		
	КонецЦикла; // Зубы
	
	// Конструкции
	ВыборкаЗубы = Результат[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЗубы.Следующий() Цикл
		
		СтруктураЗуб = стомЗубнаяКартаМетоды.НайтиЗубВКарте(СтруктураЗК, ВыборкаЗубы.ЗубВКарте);
		
		Если СтруктураЗуб = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ВыборкаВарианты = ВыборкаЗубы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаВарианты.Следующий() Цикл 
			
			СтруктураВариант = СоздатьВариант(СтруктураЗуб, ВыборкаВарианты.ВариантЗуба);
			
			ВыборкаОбласти = ВыборкаВарианты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаОбласти.Следующий() Цикл
				
				СтруктураКонструкция = СоздатьОбласть(СтруктураВариант, ВыборкаОбласти.Область);
				
				ВыборкаРасположение = ВыборкаОбласти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаРасположение.Следующий() Цикл
					ВыборкаЧасти = ВыборкаРасположение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаЧасти.Следующий() Цикл
						
						СтруктураЧастьКонструкции = СоздатьОбласть(СтруктураВариант, ВыборкаЧасти.ЧастьКонструкции);
						СтруктураКонструкция.Вставить(ВыборкаРасположение.РасположениеЧасти, СтруктураЧастьКонструкции);
						
						ВыборкаСегменты = ВыборкаЧасти.Выбрать();
						Пока ВыборкаСегменты.Следующий() Цикл 
							
							СтруктураСегмент = СоздатьСегмент(СтруктураЧастьКонструкции, ВыборкаСегменты.СегментВЗубе, соотвСозданныеСегменты);
							
						КонецЦикла; // Сегменты
						
					КонецЦикла; // Расположение и части
					
				КонецЦикла; // Расположение и части
				
			КонецЦикла; // Конструкция
			
		КонецЦикла; // Варианты
		
	КонецЦикла; // Зубы
	
	СтруктураЗК.ВыделенныеЗубыСегменты = Новый Массив;
	
	Возврат СтруктураЗК;
	
КонецФункции

Процедура ОчиститьСостоянияВариантыЗубов(СтруктураЗК)
	
	СтруктураЗК.Конструкции.Очистить();
	
	Для Каждого кзЗуб Из СтруктураЗК.Зубы Цикл
		кзЗуб.Значение.ТекущиеСегменты = Новый Соответствие;
		кзЗуб.Значение.ТекущиеСостояния = Новый Соответствие;
		кзЗуб.Значение.ОбозначениеВарианты = "";
		кзЗуб.Значение.ОбозначениеОсновнойВариант = "";
		Для Каждого кзВариант Из кзЗуб.Значение.Варианты Цикл
			кзВариант.Значение.Выбран = Ложь;
			Для Каждого кзОбласть Из кзВариант.Значение.Области Цикл
				кзОбласть.Значение.Выбран = Ложь;
			КонецЦикла;
		КонецЦикла;
		
		СтруктураЗК.ЗубыПоИд.Вставить(кзЗуб.Ключ.УникальныйИдентификатор(), кзЗуб.Значение);
		СтруктураЗК.ЗубыПоНомеру.Вставить(СокрЛП(Строка(кзЗуб.Ключ)), кзЗуб.Значение);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьШаблонЗубнойКарты(СтруктураАдресЗК, Клиент, Дата = Неопределено, ВариантКарты = Неопределено, Документ = Неопределено, АдресСостояний = Неопределено, УникальныйИдентификатор = Неопределено) Экспорт
	
	СтруктураЗК = стомЗубнаяКартаМетоды.ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	
	Если УникальныйИдентификатор <> Неопределено Тогда
		Если УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("КэшироватьДанныеЗубныхКартВПриёмах")
			И ЭтоАдресВременногоХранилища(АдресСостояний)
		Тогда
			Результат = ПолучитьИзВременногоХранилища(АдресСостояний);
		Иначе
			Запрос = стомСтоматология.СформироватьЗапросАктуальныхВариантовСостояний(СтруктураЗК.ЗубнаяКарта, Клиент, Дата, ВариантКарты, Документ);
			Результат = Запрос.ВыполнитьПакет();
			АдресСостояний = ПоместитьВоВременноеХранилище(Результат, УникальныйИдентификатор);
		КонецЕсли;
	Иначе
		Запрос = стомСтоматология.СформироватьЗапросАктуальныхВариантовСостояний(СтруктураЗК.ЗубнаяКарта, Клиент, Дата, ВариантКарты, Документ);
		Результат = Запрос.ВыполнитьПакет();
	КонецЕсли;
	
	СтруктураЗК.Клиент = Клиент;
	СтруктураЗК.Дата = Дата;
	СтруктураЗК.ВариантКарты = ВариантКарты;
	СтруктураЗК.Документ = Документ;
	
	// Установка вариантов
	ВыборкаВарианты = Результат[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ВариантЗуба");
	Пока ВыборкаВарианты.Следующий() Цикл
		
		ВыборкаОбласти = ВыборкаВарианты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Область");
		Пока ВыборкаОбласти.Следующий() Цикл 
			
			МассивЗубов = Новый Массив;
			
			ВыборкаЗубы = ВыборкаОбласти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаЗубы.Следующий() Цикл 
				МассивЗубов.Добавить(ВыборкаЗубы.ЗубВКарте);
			КонецЦикла;
			
			Область = ?(ВыборкаВарианты.ВариантЗуба.Основной, Неопределено, ВыборкаОбласти.Область);
			стомЗубнаяКартаМетоды.УстановитьВариант(СтруктураЗК, МассивЗубов, ВыборкаВарианты.ВариантЗуба, Область);
			
		КонецЦикла; // Области
		
	КонецЦикла; // Варианты
	
	// Установка конструкций
	
	ВыборкаКонструкции = Результат[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаКонструкции.Следующий() Цикл
		
		ИдКонструкции = Строка(ВыборкаКонструкции.Конструкция.УникальныйИдентификатор());
		
		ВыборкаВарианты = ВыборкаКонструкции.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Если ВыборкаВарианты.Следующий() Тогда 
			
			ВыборкаОбласти = ВыборкаВарианты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Если ВыборкаОбласти.Следующий() Тогда 
				
				МассивЗубов = Новый Массив;
				ВыборкаЗубы = ВыборкаОбласти.Выбрать();
				Пока ВыборкаЗубы.Следующий() Цикл 
					МассивЗубов.Добавить(ВыборкаЗубы.ЗубВКарте);
				КонецЦикла;
				
				стомЗубнаяКартаМетоды.УстановитьКонструкцию(
					СтруктураЗК, МассивЗубов, ВыборкаВарианты.ВариантЗуба, ВыборкаОбласти.Область, ВыборкаКонструкции.Конструкция);
				
			КонецЕсли; // Области
				
		КонецЕсли; // Варианты
		
	КонецЦикла; // Конструкции
	
	// Установка состояний
	ВыборкаЗубы = Результат[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЗубы.Следующий() Цикл
		
		ИдЗуба = ВыборкаЗубы.ЗубВКарте.УникальныйИдентификатор();
		СтруктураЗуб = СтруктураЗК.ЗубыПоИд.Получить(ИдЗуба);
		Если СтруктураЗуб = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		ВыборкаСостояния = ВыборкаЗубы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСостояния.Следующий() Цикл
			
			МассивСегментов = Новый Массив;
			
			ВыборкаСегменты = ВыборкаСостояния.Выбрать();
			Пока ВыборкаСегменты.Следующий() Цикл
				МассивСегментов.Добавить(ВыборкаСегменты.СегментВЗубе.УникальныйИдентификатор());
			КонецЦикла;
			
			стомЗубнаяКартаМетоды.УстановитьСостояние(СтруктураЗК, ИдЗуба, МассивСегментов, ВыборкаСостояния.СостояниеСегмента); 
			
		КонецЦикла; // Варианты
		
	КонецЦикла; // Зубы
	
	СтруктураЗК.ВыделенныеЗубыСегменты = Новый Массив;
	
КонецПроцедуры

#КонецОбласти

#Область КонструкторыОбъектов

Функция СоздатьЗубнуюКарту(ЗубнаяКарта, Клиент = Неопределено, Дата = Неопределено, ВариантКарты = Неопределено, Документ = Неопределено, Адрес = Неопределено, СбросВыделенияПоCtrl = Истина)
	
	СтруктураЗК = Новый Структура("ЗубнаяКарта, ВариантКарты, Клиент, Дата, Документ, Адрес, СбросВыделенияПоCtrl",
		ЗубнаяКарта, ВариантКарты, Клиент, Дата, Документ, "", СбросВыделенияПоCtrl);
	
	СтруктураЗК.Вставить("ДанныеСостояний", ПараметрыСеанса.стомКешированныеДанныеЗК.Состояния);
	СтруктураЗК.Вставить("ДанныеВариантов", ПараметрыСеанса.стомКешированныеДанныеЗК.Варианты);
	СтруктураЗК.Вставить("ДанныеДиагнозов", ПараметрыСеанса.стомКешированныеДанныеЗК.Диагнозы);
	СтруктураЗК.Вставить("Зубы", Новый Соответствие);
	СтруктураЗК.Вставить("ЗубыПоИд", Новый Соответствие);
	СтруктураЗК.Вставить("ЗубыПоНомеру", Новый Соответствие);
	СтруктураЗК.Вставить("Конструкции", Новый Соответствие);
	СтруктураЗК.Вставить("ВыделенныеЗубыСегменты", Новый Массив);
	СтруктураЗК.Вставить("ШиринаКанвы", ЗубнаяКарта.ШиринаКанвы);
	СтруктураЗК.Вставить("ВысотаКанвы", ЗубнаяКарта.ВысотаКанвы);
	СтруктураЗК.Вставить("РасположениеЗубов", стомЗубнаяКартаМетоды.ПолучитьРасположениеЗубов());
	СтруктураЗК.Вставить("ДиапазонЗубов", стомЗубнаяКартаМетоды.ПолучитьДиапазонЗубов());
	
	Возврат СтруктураЗК;
	
КонецФункции

Функция СоздатьЗуб(СтруктураЗК, ЗубВКарте)
	
	ИдЗуба = ЗубВКарте.УникальныйИдентификатор();
	НомерЗуба = СокрЛП(Строка(ЗубВКарте));
	
	СтруктураЗуб = Новый Структура("ЗубнаяКарта, ЗубВКарте, Зуб", СтруктураЗК.ЗубнаяКарта, ЗубВКарте, ЗубВКарте.Зуб);
	СтруктураЗуб.Вставить("Идентификатор", ИдЗуба);
	СтруктураЗуб.Вставить("Варианты", Новый Соответствие);
	СтруктураЗуб.Вставить("ШиринаКанвы", ЗубВКарте.Зуб.ШиринаКанвы);
	СтруктураЗуб.Вставить("ВысотаКанвы", ЗубВКарте.Зуб.ВысотаКанвы);
	СтруктураЗуб.Вставить("ПараметрыРасположения", СоздатьПараметрыРасположенияЭлемента(ЗубВКарте));
	СтруктураЗуб.Вставить("ТекущиеСегменты", Новый Соответствие);
	СтруктураЗуб.Вставить("ТекущиеСостояния", Новый Соответствие);
	СтруктураЗуб.Вставить("Расположение", СтруктураЗК.РасположениеЗубов.Получить(НомерЗуба));
	СтруктураЗуб.Вставить("Обозначение", Строка(ЗубВКарте));
	СтруктураЗуб.Вставить("ОбозначениеОсновнойВариант", "");
	СтруктураЗуб.Вставить("ОбозначениеВарианты", "");
	СтруктураЗуб.Вставить("ОбозначениеСостояния", "");
	
	СтруктураЗК.Зубы.Вставить(ЗубВКарте, СтруктураЗуб);
	СтруктураЗК.ЗубыПоИд.Вставить(ЗубВКарте.УникальныйИдентификатор(), СтруктураЗуб);
	СтруктураЗК.ЗубыПоНомеру.Вставить(НомерЗуба, СтруктураЗуб);
	
	Возврат СтруктураЗуб;
	
КонецФункции

Функция СоздатьВариант(СтруктураЗуб, ВариантЗуба, Нумерация = Неопределено)
	
	СтруктураВариант = Новый Структура("ЗубВКарте, ВариантЗуба, Выбран",
		СтруктураЗуб.ЗубВКарте, ВариантЗуба, Ложь);
	СтруктураВариант.Вставить("Основной", ВариантЗуба.Основной);
	СтруктураВариант.Вставить("Обозначение", ВариантЗуба.Обозначение);
	СтруктураВариант.Вставить("Конструкция", ВариантЗуба.Конструкция);
	СтруктураВариант.Вставить("Области", Новый Соответствие);
	
	Если СтруктураВариант.Основной Тогда 
		СтруктураВариант.Вставить("Нумерация", ?(Нумерация = Неопределено, Строка(СтруктураЗуб.ЗубВКарте), Нумерация));
	КонецЕсли;
	
	СтруктураЗуб.Варианты.Вставить(ВариантЗуба, СтруктураВариант);
	
	Возврат СтруктураВариант;
	
КонецФункции

Функция СоздатьОбласть(СтруктураВариант, Область)
	
	СтруктураОбласть = Новый Структура("ЗубВКарте, ВариантЗуба, Область, Выбран", 
		СтруктураВариант.ЗубВКарте, СтруктураВариант.ВариантЗуба, Область, Ложь);
	СтруктураОбласть.Вставить("Декоративная", Область.Декоративная);
	СтруктураОбласть.Вставить("ВидОбласти", Область.ВидОбласти);
	СтруктураОбласть.Вставить("Конструкция", 
		Область.ВидОбласти = Перечисления.стомВидыОбластей.Конструкция Или 
		Область.ВидОбласти = Перечисления.стомВидыОбластей.ЭлементКонструкции);
	
	Если Область.ВидОбласти = Перечисления.стомВидыОбластей.ОбластьЗуба Тогда  
		СтруктураОбласть.Вставить("Сегменты", Новый Соответствие);
		СтруктураОбласть.Вставить("СегментыПоИд", Новый Соответствие);
		СтруктураВариант.Области.Вставить(Область, СтруктураОбласть);
	ИначеЕсли Область.ВидОбласти = Перечисления.стомВидыОбластей.Конструкция Тогда 
		СтруктураОбласть.Вставить("Начало");
		СтруктураОбласть.Вставить("Середина");
		СтруктураОбласть.Вставить("Конец");
		СтруктураОбласть.Вставить("ВыбраннаяЧастьКонструкции");
		СтруктураВариант.Области.Вставить(Область, СтруктураОбласть);
	ИначеЕсли Область.ВидОбласти = Перечисления.стомВидыОбластей.ЭлементКонструкции Тогда
		СтруктураОбласть.Вставить("Сегменты", Новый Соответствие);
		СтруктураОбласть.Вставить("СегментыПоИд", Новый Соответствие);
		СтруктураОбласть.Вставить("КонструкцияРодитель", Область.КонструкцияРодитель);
	КонецЕсли;
	
	Возврат СтруктураОбласть;
	
КонецФункции

Функция СоздатьСегмент(СтруктураОбласть, СегментВЗубе, СозданныеСегменты)
	
	ИдСегмента = СегментВЗубе.УникальныйИдентификатор();
	СтруктураСегмент = СозданныеСегменты.Получить(ИдСегмента);
	
	Если СтруктураСегмент = Неопределено Тогда 
		
		СтруктураСегмент = Новый Структура("ЗубВКарте, ВариантЗуба, Область, СегментВЗубе, Декоративный", 
			СтруктураОбласть.ЗубВКарте, СтруктураОбласть.ВариантЗуба, СтруктураОбласть.Область, СегментВЗубе, СтруктураОбласть.Декоративная);
		СтруктураСегмент.Вставить("Идентификатор", ИдСегмента);
		СтруктураСегмент.Вставить("ПараметрыРасположения", СоздатьПараметрыРасположенияЭлемента(СегментВЗубе));
		СтруктураСегмент.Вставить("ЦветПоУмолчанию", "#" + НРег(Прав(СегментВЗубе.Сегмент.ЦветHex, 6)));
		СтруктураСегмент.Вставить("Фигура", СегментВЗубе.Сегмент.Фигура);
		СтруктураСегмент.Вставить("Конструкция", СтруктураОбласть.Конструкция);
			
		СозданныеСегменты.Вставить(ИдСегмента, СтруктураСегмент);
		
	КонецЕсли;
	
	СтруктураОбласть.Сегменты.Вставить(СегментВЗубе, СтруктураСегмент);
	СтруктураОбласть.СегментыПоИд.Вставить(СегментВЗубе.УникальныйИдентификатор(), СтруктураСегмент);
	
	Возврат СтруктураСегмент;
	
КонецФункции

Функция СоздатьСостояниеМаски(СостояниеЗуба, ПозицияВМаске)
	
	СтруктураСостояние = Новый Структура("Состояние", СостояниеЗуба);
	СтруктураСостояние.Вставить("ПозицияВМаске", ПозицияВМаске);
	СтруктураСостояние.Вставить("ЦветHex", "#" + НРег(Прав(СостояниеЗуба.ЦветHex, 6)));
	СтруктураСостояние.Вставить("Цвет", ПоместитьВоВременноеХранилище(СостояниеЗуба.Цвет.Получить(), Новый УникальныйИдентификатор));
	СтруктураСостояние.Вставить("ДанныеПриложения", СостояниеЗуба.СтроковоеПредставление);
	СтруктураСостояние.Вставить("Обозначение", СостояниеЗуба.КраткоеОбозначение);
	
	Возврат Новый ФиксированнаяСтруктура(СтруктураСостояние);
	
КонецФункции

Функция СоздатьВариантМаски(ВариантЗуба, ПозицияВМаске)
	
	СтруктураВариант = Новый Структура("Вариант", ВариантЗуба);
	СтруктураВариант.Вставить("ПозицияВМаске", ПозицияВМаске);
	СтруктураВариант.Вставить("Основной", ВариантЗуба.Основной);
	СтруктураВариант.Вставить("Конструкция", ВариантЗуба.Конструкция);
	СтруктураВариант.Вставить("Области", Новый Массив);
	
	Для Каждого СтрокаОбласть Из ВариантЗуба.СписокОбластей Цикл
		СтруктураВариант.Области.Добавить(СтрокаОбласть.Область);
	КонецЦикла;
	
	СтруктураВариант.Вставить("Области", Новый ФиксированныйМассив(СтруктураВариант.Области));
	
	Возврат Новый ФиксированнаяСтруктура(СтруктураВариант);
	
КонецФункции

Функция СоздатьДиагнозМаски(Диагноз, ПозицияВМаске)
	
	СтруктураДиагноз = Новый Структура("Диагноз", Диагноз);
	СтруктураДиагноз.Вставить("ПозицияВМаске", ПозицияВМаске);
	
	Возврат Новый ФиксированнаяСтруктура(СтруктураДиагноз);
	
КонецФункции

Функция СоздатьПараметрыРасположенияЭлемента(ЗубВКартеСегментВЗубе)
	
	СтруктПараметры = Новый Структура("x, y, sX, sY, r, z",
		ЗубВКартеСегментВЗубе.TranslateX, 
		ЗубВКартеСегментВЗубе.TranslateY,
		ЗубВКартеСегментВЗубе.ScaleX,
		ЗубВКартеСегментВЗубе.ScaleY,
		ЗубВКартеСегментВЗубе.Rotation,
		ЗубВКартеСегментВЗубе.ZIndex);
	
	Возврат СтруктПараметры;
	
КонецФункции

#Область ЭкспортныеОбъектыСоздаваемыеВХодеРаботы 

Функция СоздатьКонструкцию(СтруктураАдресЗК, Вариант, Область, Конструкция = Неопределено) Экспорт
	
	СтруктураЗК = стомЗубнаяКартаМетоды.ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	
	КонструкцияСсылка = Конструкция;
	Если Конструкция = Неопределено Тогда
		КонструкцияОбъект = Справочники.стомКонструкцииЗубовКлиентов.СоздатьЭлемент();
		КонструкцияОбъект.Владелец = СтруктураЗК.Клиент;
		КонструкцияОбъект.Предварительная = Истина;
		КонструкцияОбъект.Записать();
		КонструкцияСсылка = КонструкцияОбъект.Ссылка;
	КонецЕсли;
	
	ИдКонструкции = КонструкцияСсылка.УникальныйИдентификатор();
	
	СтруктураКонструкция = Новый Структура("ЗубнаяКарта, Вариант, Область, Идентификатор, Удалена",
		СтруктураЗК.ЗубнаяКарта, Вариант, Область, ИдКонструкции, Ложь);
	СтруктураКонструкция.Вставить("Конструкция", КонструкцияСсылка);
	СтруктураКонструкция.Вставить("СоставЗубов", Новый Массив);
	СтруктураКонструкция.Вставить("СоставЗубовСтрокой", "");
	СтруктураКонструкция.Вставить("Обозначение", Строка(КонструкцияСсылка));
	СтруктураКонструкция.Вставить("Комментарий", КонструкцияСсылка.Комментарий);
	СтруктураКонструкция.Вставить("НеСоздана", Конструкция = Неопределено);
	
	СтруктураЗК.Конструкции.Вставить(ИдКонструкции, СтруктураКонструкция);
	
	Возврат СтруктураКонструкция;
	
КонецФункции

Функция СоздатьТекущийСегмент(СтруктураЗуб, СтруктураСегмент) Экспорт
	
	СтруктураТекСегмент = Новый Структура("СтруктураСегмент, Идентификатор, СегментВЗубе",
		СтруктураСегмент, СтруктураСегмент.Идентификатор, СтруктураСегмент.СегментВЗубе);
		
	// Список установленных вариантов, в которых сегмент участвует (один и тот же сегмент может быть в нескольких)
	// Если сегмент не содержится ни в одном варианте, он должен быть исключен из зуба
	СтруктураТекСегмент.Вставить("Варианты", Новый Соответствие);
	СтруктураТекСегмент.Вставить("Состояния", Новый Соответствие); // Состояния, установленные на сегмент
	СтруктураТекСегмент.Вставить("Обозначение", Строка(СтруктураСегмент.СегментВЗубе));
	СтруктураТекСегмент.Вставить("ОбозначениеСостояний", "");
	
	СтруктураЗуб.ТекущиеСегменты.Вставить(СтруктураСегмент.Идентификатор, СтруктураТекСегмент);
	
	Возврат СтруктураТекСегмент;
	
КонецФункции

Функция СформироватьТекстПоляУпрощеннойЗубнойКарты(СтруктураАдресЗК) Экспорт
	
	СтруктураЗК = стомЗубнаяКартаМетоды.ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	
	ДокументHTML = Справочники.стомВидыЗубныхКарт.ПолучитьМакет("ЗубнаяКартаУпрощеннаяHTML").ПолучитьДокументHTML();
	
	Для Каждого кзЗуб Из СтруктураЗК.Зубы Цикл
		
		СтруктураЗуб = кзЗуб.Значение;
		Если СтруктураЗуб.Расположение = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементЗуб = ДокументHTML.ПолучитьЭлементПоИдентификатору(СтруктураЗуб.Расположение.Номер);
		Если ЭлементЗуб = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементЗуб.ТекстовоеСодержимое = СтруктураЗуб.Обозначение;
		ЭлементЗуб.Идентификатор = Строка(СтруктураЗуб.Идентификатор);
		
		Для Каждого ВыделенныйЗуб Из СтруктураЗК.ВыделенныеЗубыСегменты Цикл
			Если ВыделенныйЗуб.ЗубВКарте = СтруктураЗуб.ЗубВКарте Тогда
				ЭлементЗуб.parentNode.className = "focus";
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат РаботаСDOMКлиентСервер.ПолучитьТекстHTMLДокументаDOM(ДокументHTML);
	
КонецФункции

#КонецОбласти

#КонецОбласти
